IRP/src/Catalogs/Currencies/Currencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Currencies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Symbol</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>NumericCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/IntegrationType/IntegrationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>IntegrationType</name>
 <enumValues>
  <name>Other</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRates</name>
 </enumValues>
 <enumValues>
  <name>FileStorage</name>
 </enumValues>
 <enumValues>
  <name>LocalFileStorage</name>
 </enumValues>
 <enumValues>
  <name>Email</name>
 </enumValues>
 <enumValues>
  <name>ClientBank</name>
 </enumValues>
 <enumValues>
  <name>SMSProvider</name>
 </enumValues>
 <enumValues>
  <name>Equipment</name>
 </enumValues>
 <enumValues>
  <name>VisitorCounter</name>
 </enumValues>
 <enumValues>
  <name>AccountingService</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/IntegrationSettings/IntegrationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>IntegrationSettings</name>
  <attributes>
    <name>ExternalDataProc</name>
    <type>
      <types>CatalogRef.ExternalDataProc</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcSettings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationType</name>
    <type>
      <types>EnumRef.IntegrationType</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreInSecureStorage</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ConnectionSetting</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConnectionSettingTest</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Currencies/Forms/SelectIntegration/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Query = New Query();
	Query.Text =
	"SELECT
	|	IntegrationSettings.Ref AS IntegrationSettings
	|FROM
	|	Catalog.IntegrationSettings AS IntegrationSettings
	|WHERE
	|	NOT IntegrationSettings.DeletionMark
	|	AND IntegrationSettings.IntegrationType = VALUE(Enum.IntegrationType.CurrencyRates)";

	QueryResult = Query.Execute();
	ThisObject.IntegrationTable.Load(QueryResult.Unload());
EndProcedure

&AtClient
Procedure IntegrationTableSelection(Item, RowSelected, Field, StandardProcessing)
	ReturnSelectedIntegrationSettings();
EndProcedure

&AtClient
Procedure ReturnSelectedIntegrationSettings()
	CurrentRow = Items.IntegrationTable.CurrentData;
	If CurrentDate() = Undefined Then
		Close(Undefined);
	Else
		Close(New Structure("IntegrationSettings", CurrentRow.IntegrationSettings));
	EndIf;
EndProcedure

&AtClient
Procedure Ok(Command)
	ReturnSelectedIntegrationSettings();
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close();
EndProcedure
